# алфавит
alphabent_to = {
    "А": ".-",
    "Б": "-...",
    "В": ".--",
    "Г": "--.",
    "Д": "-..",
    "Е": ".",
    "Ж": "...-",
    "З": "--..",
    "И": "..",
    "Й": ".---",
    "К": "-.-",
    "Л": ".-..",
    "М": "--",
    "Н": "-.",
    "О": "---",
    "П": ".--.",
    "Р": ".-.",
    "С": "...",
    "Т": "-",
    "У": "..-",
    "Ф": "..-.",
    "Х": "....",
    "Ц": "-.-.",
    "Ч": "---.",
    "Ш": "----",
    "Щ": "--.-",
    "Ъ": "--.--",
    "Ы": "-.--",
    "Ь": "-..-",
    "Э": "..-..",
    "Ю": "..--",
    "Я": ".-.-",
    " ": "_"
}

alphabent_from = {
    ".-": "А",
    "-...": "Б",
    ".--": "В",
    "--.": "Г",
    "-..": "Д",
    ".": "Е",
    "...-": "Ж",
    "--..": "З",
    "..": "И",
    ".---": "Й",
    "-.-": "К",
    ".-..": "Л",
    "--": "М",
    "-.": "Н",
    "---": "О",
    ".--.": "П",
    ".-.": "Р",
    "...": "С",
    "-": "Т",
    "..-": "У",
    "..-.": "Ф",
    "....": "Х",
    "-.-.": "Ц",
    "---.": "Ч",
    "----": "Ш",
    "--.-": "Щ",
    "--.--": "Ъ",
    "-.--": "Ы",
    "-..-": "Ь",
    "..-..": "Э",
    "..--": "Ю",
    ".-.-": "Я",
    "_": " "
}


def encode_to_morse(text):
    out_text = ""
    for a in text.upper():
        out_text += " " + alphabent_to[a]
    return out_text


def decode_from_morse(code):
    out_text = ""
    code = code.split()
    for a in code:
        out_text += alphabent_from[a]
    return out_text


def main():
    enc = encode_to_morse("привет мир")
    print(enc)
    print(decode_from_morse(enc))
